---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsColor
source: html/f1d18297-cf18-c086-11f9-23582ce4690f.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.GetValueAsColor Method

Gets the value property as a color.

## Syntax (C#)
```csharp
public Color GetValueAsColor()
```

## Returns
The color value.